In [8]:
topic_file = "/data/movie_data/movies.csv"
users_file = "/data/movie_data/users.csv"
ratings_file = "/data/movie_data/rating.csv"

In [24]:
import pandas as pd
topics = pd.read_csv(topic_file)

In [25]:
topics.head()

   ID                                NAME                      CATEGORY
0   1                    Toy Story (1995)   Animation|Children's|Comedy
1   2                      Jumanji (1995)  Adventure|Children's|Fantasy
2   3             Grumpier Old Men (1995)                Comedy|Romance
3   4            Waiting to Exhale (1995)                  Comedy|Drama
4   5  Father of the Bride Part II (1995)                        Comedy

In [11]:
ratings = pd.read_csv(ratings_file)
ratings.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [12]:
users = pd.read_csv(users_file)
users.head()

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117
3       4      M   45           7    02460
4       5      M   25          20    55455

In [27]:
user_rating = pd.merge(users,ratings,on='UserID')
user_rating_mv = pd.merge(user_rating, topics, left_on="MovieID", right_on="ID")

In [28]:
user_rating_mv

,UserID,Gender,Age,Occupation,Zip-code,MovieID,Rating,Timestamp,ID,NAME,CATEGORY
0,1,F,1,10,48067,1193,5,978300760,1193,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,M,56,16,70072,1193,5,978298413,1193,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,M,25,12,32793,1193,4,978220179,1193,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,M,25,7,22903,1193,4,978199279,1193,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,M,50,1,95350,1193,5,978158471,1193,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...,...
1000204,5949,M,18,17,47901,2198,5,958846401,2198,Modulations (1998),Documentary
1000205,5675,M,35,14,30030,2703,3,976029116,2703,Broken Vessels (1998),Drama
1000206,5780,M,18,17,92886,2845,1,958153068,2845,White Boys (1999),Drama
1000207,5851,F,18,20,55410,3607,5,957756608,3607,One Little Indian (1973),Comedy|Drama|Western
1000208,5938,M,25,1,35401,2909,4,957273353,2909,"Five Wives, Three Secretaries and Me (1998)",Documentary

In [49]:
user_rating_mv[user_rating_mv['Gender']=='F'].groupby(['Gender','Age', 'NAME']).NAME.value_counts().nlargest(50)

Gender  Age  NAME                                                   NAME
F       25   American Beauty (1999)                                 American Beauty (1999)                                   361
             Shakespeare in Love (1998)                             Shakespeare in Love (1998)                               276
             Silence of the Lambs, The (1991)                       Silence of the Lambs, The (1991)                         273
             Princess Bride, The (1987)                             Princess Bride, The (1987)                               259
             Fargo (1996)                                           Fargo (1996)                                             253
             Star Wars: Episode V - The Empire Strikes Back (1980)  Star Wars: Episode V - The Empire Strikes Back (1980)    247
             Star Wars: Episode VI - Return of the Jedi (1983)      Star Wars: Episode VI - Return of the Jedi (1983)        245
             Being John Malkovich (1999)                            Being John Malkovich (1999)                              240
             Sixth Sense, The (1999)                                Sixth Sense, The (1999)                                  238
             Back to the Future (1985)                              Back to the Future (1985)                                236
             Groundhog Day (1993)                                   Groundhog Day (1993)                                     235
             Shawshank Redemption, The (1994)                       Shawshank Redemption, The (1994)                         233
             Forrest Gump (1994)                                    Forrest Gump (1994)                                      229
             Star Wars: Episode IV - A New Hope (1977)              Star Wars: Episode IV - A New Hope (1977)                229
             Raiders of the Lost Ark (1981)                         Raiders of the Lost Ark (1981)                           223
             Pulp Fiction (1994)                                    Pulp Fiction (1994)                                      219
             E.T. the Extra-Terrestrial (1982)                      E.T. the Extra-Terrestrial (1982)                        217
             Schindler's List (1993)                                Schindler's List (1993)                                  214
             Jurassic Park (1993)                                   Jurassic Park (1993)                                     210
             L.A. Confidential (1997)                               L.A. Confidential (1997)                                 206
             Saving Private Ryan (1998)                             Saving Private Ryan (1998)                               206
             Toy Story (1995)                                       Toy Story (1995)                                         203
             Men in Black (1997)                                    Men in Black (1997)                                      198
             Braveheart (1995)                                      Braveheart (1995)                                        194
             Matrix, The (1999)                                     Matrix, The (1999)                                       193
             When Harry Met Sally... (1989)                         When Harry Met Sally... (1989)                           193
             Babe (1995)                                            Babe (1995)                                              191
             Edward Scissorhands (1990)                             Edward Scissorhands (1990)                               190
             Fugitive, The (1993)                                   Fugitive, The (1993)                                     187
             Ghostbusters (1984)                                    Ghostbusters (1984)                                      187
             Stand by Me (1986)                                     Stand by Me (1986)                                       187
             Terminator 2: Judgment Day (1991)                      Terminator 2: Judgment Day (1991)                        187
        18   American Beauty (1999)                                 American Beauty (1999)                                   186
        25   Breakfast Club, The (1985)                             Breakfast Club, The (1985)                               180
             Clueless (1995)                                        Clueless (1995)                                          180
             Four Weddings and a Funeral (1994)                     Four Weddings and a Funeral (1994)                       175
             Election (1999)                                        Election (1999)                                          172
             As Good As It Gets (1997)                              As Good As It Gets (1997)                                170
             Star Wars: Episode I - The Phantom Menace (1999)       Star Wars: Episode I - The Phantom Menace (1999)         170
             Thelma & Louise (1991)                                 Thelma & Louise (1991)                                   168
             Good Will Hunting (1997)                               Good Will Hunting (1997)                                 167
             High Fidelity (2000)                                   High Fidelity (2000)                                     165
             Wizard of Oz, The (1939)                               Wizard of Oz, The (1939)                                 164
             Ferris Bueller's Day Off (1986)                        Ferris Bueller's Day Off (1986)                          163
             Godfather, The (1972)                                  Godfather, The (1972)                                    163
        35   American Beauty (1999)                                 American Beauty (1999)                                   162
        25   Titanic (1997)                                         Titanic (1997)                                           161
             Usual Suspects, The (1995)                             Usual Suspects, The (1995)                               161
             Pretty Woman (1990)                                    Pretty Woman (1990)                                      160
             Raising Arizona (1987)                                 Raising Arizona (1987)                                   159
Name: NAME, dtype: int64